from ollama import chat
from ollama import ChatResponse

response: ChatResponse = chat(model='gpt-oss:20b', messages=[
  {
    'role':'system',
    'content': '''You are teacher of ukrainian university you check works with given instructions, so user requests and your responses will be in ukrainian language. 
    Further instructuon also will be in ukrainian language. Ти виконуєш перевірку лабораторних робіт з дисципліни "Основи технологій R&D", 
користувач надасть тобі завдання до роботи, критерії оцінювання виконання цих завдань. Критерії будуть у такому форматі:
1. Пункт 1: <опис балів за цей пункт та як їх висталяти>
2. Пункт 2: <опис балів за цей пункт та як їх висталяти>
3. Пункт 3: <опис балів за цей пункт та як їх висталяти>
4. Пункт 4: <опис балів за цей пункт та як їх висталяти>
5. Пункт 5: <опис балів за цей пункт та як їх висталяти>
Описи балів та правила їх виставлення розілений за допомогою ; для кожного балу, наприклад: 2 бали, <опис правил оцінювання>; 1 бал, <опис правил оцінювання>; 0 балів, <опис правил оцінювання>

Користувач надасть свою роботу, яка матиме приблизно такий вигляд:
1. Тема дослідження: <опис теми дослідження>
2. Використані джерела: <список використаних наукових джерел>
3. Основні підходи та принципи: <опис підходів та принципів у межах теми>
4. Проблеми та гіпотези: <опис проблем та гіпотез дослідження, пов'язаних із темою>
5. Ідеї та підходи для вирішення цих проблем: <опис практичних підходів, що вирішують проблеми і гіпотези з пункту 4>

Ти НЕ переписуєш текст, ти НЕ узагальнюєш текст, ти НЕ додаєш нову інформацію, ти лише виставляєш бали за критеріями, які надає користувач
Відповідай СТРОГО у форматі
Пункт 1: <0-2>
Пункт 2: <0-2>
Пункт 3: <0-2>
Пункт 4: <0-2>
Пункт 5: <0-2>
Загальний бал: <0-10>
будь який інший текст заборонений'''
     
  },
  {
    'role': 'user',
    'content': '''Перевір мою роботу, ось опис завдань рботи
1. Обрати тему дослідження (на вибір студента – але найкраще взяту тему дипломного проекту). 
2. Провести огляд наукових джерел (монографії, статті, аналітичні звіти). 
3. Визначити ключові теоретичні підходи та принципи у межах теми. 
4. Сформулювати проблемні питання та гіпотези дослідження. 
5. Запропонувати не менше 3-4 новітніх ідей або концептуальних підходів. Описати їх. 

Роботу потрібно оцінити за 10 бальною шкалою, на кожен пункт умови виділено по 2 бали:
1. Пункт 1: 2 бали, якщо тема сформована чітко, такоє пояснено її актуальність; 1 бал, якщо тема сформована поверхнево чи надто загально; 0 балів, якщо тема не сформована чи відсутня
2. Пункт 2: 2 бали, якщо наукових джерел 3 і більше; 1 бал, якщо наукових джерел від 1 до 2; 0 балів, якщо наукових джерел у пункці відсутні
3. Пункт 3: 2 бали, якщо виділено 3 і більше підходів чи принципів, пов'язаних із темою і вони вичерпно пояснені; 1 бал, якщо вказано менше 1 чи 2 підходи, які пояснені поверхнево; 0 балів, якщо підходи і принципи у пункті відсутні.
4. Пункт 4: 2 бали, якщо виділено 3 і більше проблемних питання чи гіпотез дослідження, описано що саме потрібно в них вирішити, 
1 бал, якщо проблемних питань чи гіпотез вказано 1 чи 2 і вони описані поверхнево; 0 балів, якщо проблемні питання чи гіпотези відсутні
5. Пункт 5: 2 бали, якщо запропоновано не менше 3-4 новітніх ідеї чи концептуальних підходів, наявний опис того як мають мають працювати ці підходи, опис може бути не надто детальним, але суть описаних підходів має бути зрозуміла; 1 бал, якщо описано 1 чи 2 підходи, опис загальний, не описано як саме мають працювати підходи; 0 балів, якщо підходи не описані чи відсутні   

Ось сама робота:

1. Тема дослідження: Автоматизована перевірка текстових робіт за допомогою ШІ. 
2. Використані джерела
Для аналізу даної тематики були використані такі джерела:
1)	Штучний інтелект оцінює роботи учнів нарівні з учителями, але має обмеження
2)	A survey of automated essay scoring: Challenges, advances, and future

Такі підходи використовуються для зменшення навантаження на вчителів\викладачів та збільшення їх вільного часу, через проблеми суб’єктивності та непослідовності оцінювання робіт людиною, особливо під час втоми. Крім цього, загальна швидкість перевірки значно вища, ніж людська, а збережений час можна використати для покращення самих робіт і підходів до викладання. Одним із прикладів такої системи перевірка на платформі Coursera, де ШІ виконує оцінювання завдань за певними рубриками і може надавати розгорнутий відгук студенту про роботу, її недоліки та сильні сторони і що можна покращити. Для роботи системи потрібно виконати початкове налаштування під певну дисципліну, як то створення запиту, надання прикладів робіт тощо. Також роботу цих систем можна коригувати та змінювати результати перевірки за потреби.

3. Основні підходи та принципи:
1)	Prompt-інженерія: використання правильних запитів до великих мовних моделей з наданим контекстом у запиті, дається робота на оцінювання. Для ШІ виділяются конкретні рубрики та система оцінювання, за якими він має оцінити роботу, що підвищує точність. Надання інструкцій моделі щодо того, як має перевірятися робота або надання інструкції і кілької прикладів перевірки(zero-shot та few-shot підходи відповідно), надання запитів із вказанням конкретних кроків, які має виконати ШІ для перевірки роботи(наприклад: надання ролі, опису завдання і рубрик оцінювання, надання інструкції для оцінювання та надання прикладів оцінювання) тим самим змушуючи модель працювати в режимі ланцюжка думок.
2)	Fine-tuning: дотреновування частини ваг великої мовної моделі на даних під специфічну сферу\задачу. Тренувальний датасет містить пари запитів та очікуваних відповідей. За рахунок тренувань модель починає краще відповідати на специфічні запити, наприклад щодо фізики. На вхід подаються запитання щодо певної теми, а в очікуванні відповіді  на поставлене питання міститься відповідна теорія. Фактично знання “вшиваються” у ваги моделі.

4. Проблеми та гіпотези:
Незважаючи на переваги цих методу перевірки, є певні проблеми та питання, які можуть виникнути:

1)	Залежність від якості і розміру датасету: для якісної роботи таких систем потрібен якісний датасет з великою кількістю різноманітних даних, яких може не бути в потрібній кількості в результаті звичайних перевірок робіт.
2)	Можливість обходу правил оцінювання студентами задля отримання вищого балу: знаючи правила та інструкції, за якими оцінюються роботи, можна створити роботи таким чином, які формально відповідають критеріям, але насправді не є коректними.

5. Ідеї та підходи для вирішення цих проблем:
1)	Використання систем із RAG: за відсутності достатньої кількості робіт для створення тренувального датасету, але за достатньої кількості даних про певну сферу, якої стосуються роботи студентів (документи, лекції, книжки, статті тощо) можна завантажити їх у векторну базу даних і , використовуючи разом із prompt-інжинірингом, дані, знайдені за запитом, будуть автоматично діставатися з цієї бази та вставлятися у запит у вигляді контексту, тим самим обмежуючи кількість зайвої інформації, яку може використати модель під час відповіді і надаючи потрібну для перевірки роботи. Наприклад, для кожного завдання модель отримає дані з лекцій, де може міститися інформація про розв’язання певних задач, чи дістане інформацію по предметній області за темою, метою та поставленими задачами в роботі.
2)	Сервіс-посередник для забезпечення безпеки: сервіс, який перед відправкою робіт до системи перевірки ШІ буде виконувати приховування чи зміну даних користувачів, наприклад групи та ПІБ студентів і викладачів, таким чином уникаючи надання справжніх даних. Виставлення балів ШІ також буде відбуватися саме в цей сервіс, а не безпосередньо в систему закладу освіти, ці бали потім можна перенести. Крім цього, перед безпосередньої відправкою робіт до системи перевірки, роботи перевірятимуться на наявність шкідливого\некоректного вмісту за допомогою NLP, семантичного аналізу, інструментів автоматичної модерації чи інших ШІ, здатних виявляти цей вміст.

    ''',
  },
])

print(response.message.content)