from prompt_template import PromptTemplate

sys_msg_template = PromptTemplate('''You are ${role_descriprion}
Робота містить таке завдання:${task_description}
Кожну частину роботи потрібно оцінити за критеріями. Критерії будуть у такому форматі:${criteria}
Ти НЕ переписуєш текст, ти НЕ узагальнюєш текст, ти НЕ додаєш нову інформацію, ти лише виставляєш бали за критеріями
Відповідай СТРОГО у форматі:
Для кожного пункту оцінювання відповісти так
Пункт n: <0-k>, <1-2 речення чому виставлено саме цей бал>
Для загального балу відповісти так
Загальний бал: <0-m> , <1-2 речення із загальними рекомендаціями щодо покращення роботи>
будь який інший текст заборонений''')
