usr_msg = '''Перевір мою роботу, ось сама робота:

1. Тема дослідження: Автоматизована перевірка текстових робіт за допомогою ШІ. 

3. Основні підходи та принципи:
1)	Prompt-інженерія: використання правильних запитів до великих мовних моделей з наданим контекстом у запиті, дається робота на оцінювання. Для ШІ виділяются конкретні рубрики та система оцінювання, за якими він має оцінити роботу, що підвищує точність. Надання інструкцій моделі щодо того, як має перевірятися робота або надання інструкції і кілької прикладів перевірки(zero-shot та few-shot підходи відповідно), надання запитів із вказанням конкретних кроків, які має виконати ШІ для перевірки роботи(наприклад: надання ролі, опису завдання і рубрик оцінювання, надання інструкції для оцінювання та надання прикладів оцінювання) тим самим змушуючи модель працювати в режимі ланцюжка думок.
2)	Fine-tuning: дотреновування частини ваг великої мовної моделі на даних під специфічну сферу\задачу. Тренувальний датасет містить пари запитів та очікуваних відповідей. За рахунок тренувань модель починає краще відповідати на специфічні запити, наприклад щодо фізики. На вхід подаються запитання щодо певної теми, а в очікуванні відповіді  на поставлене питання міститься відповідна теорія. Фактично знання “вшиваються” у ваги моделі.

4. Проблеми та гіпотези:
Незважаючи на переваги цих методу перевірки, є певні проблеми та питання, які можуть виникнути:

1)	Залежність від якості і розміру датасету: для якісної роботи таких систем потрібен якісний датасет з великою кількістю різноманітних даних, яких може не бути в потрібній кількості в результаті звичайних перевірок робіт.
2)	Можливість обходу правил оцінювання студентами задля отримання вищого балу: знаючи правила та інструкції, за якими оцінюються роботи, можна створити роботи таким чином, які формально відповідають критеріям, але насправді не є коректними.
'''